fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <tabularSections>
    <name>ВКМ_СписокСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВКМ_Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>ВКМ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВКМ_Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РазмерНДФЛ = Константы.ВКМ_РазмерНДФЛ.Получить();
	
	Если Не ЗначениеЗаполнено(РазмерНДФЛ) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не установлено значение НДФЛ.";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ВКМ_СписокСотрудников Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_ФиксированнаяПремия;
		Движение.ВКМ_Сотрудник = СтрокаТЧ.ВКМ_Сотрудник;
		Движение.ВКМ_Результат = СтрокаТЧ.ВКМ_СуммаПремии;
		
		РазмерУдержания = РасчитатьНДФЛ(СтрокаТЧ.ВКМ_Сотрудник, СтрокаТЧ.ВКМ_СуммаПремии, РазмерНДФЛ);
		
		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеВзаиморасчеты.Период = Дата;
		ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВзаиморасчеты.ВКМ_Сотрудник = СтрокаТЧ.ВКМ_Сотрудник;
		ДвижениеВзаиморасчеты.ВКМ_Сумма = Движение.ВКМ_Результат - РазмерУдержания ;
		
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
		
КонецПроцедуры

Функция РасчитатьНДФЛ(Сотрудник, СуммаПремии, РазмерНДФЛ)
	
	Движение = Движения.ВКМ_Удержания.Добавить();
	Движение.ПериодРегистрации = Дата;
	Движение.ВКМ_Сотрудник = Сотрудник;
	Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ;
	Движение.ВКМ_Значение = РазмерНДФЛ;	
	Движение.ВКМ_Результат = СуммаПремии * 13 /100 ;
	
	Движения.ВКМ_Удержания.Записать();
	
	Возврат Движение.ВКМ_Результат;	
	
КонецФункции
